"""
**需求** 输出 九九乘法表，格式如下：
1 * 1 = 1
1 * 2 = 2	2 * 2 = 4
1 * 3 = 3	2 * 3 = 6	3 * 3 = 9
1 * 4 = 4	2 * 4 = 8	3 * 4 = 12	4 * 4 = 16
1 * 5 = 5	2 * 5 = 10	3 * 5 = 15	4 * 5 = 20	5 * 5 = 25
1 * 6 = 6	2 * 6 = 12	3 * 6 = 18	4 * 6 = 24	5 * 6 = 30	6 * 6 = 36
1 * 7 = 7	2 * 7 = 14	3 * 7 = 21	4 * 7 = 28	5 * 7 = 35	6 * 7 = 42	7 * 7 = 49
1 * 8 = 8	2 * 8 = 16	3 * 8 = 24	4 * 8 = 32	5 * 8 = 40	6 * 8 = 48	7 * 8 = 56	8 * 8 = 64
1 * 9 = 9	2 * 9 = 18	3 * 9 = 27	4 * 9 = 36	5 * 9 = 45	6 * 9 = 54	7 * 9 = 63	8 * 9 = 72	9 * 9 = 81
"""
# 定义起始行
row = 1

# 最大打印9行
while row <= 9:
    # 增加一个小的循环，专门负责当前行中，每一"列"的星星显示
    # 1.定义一个列计数器变量
    # 定义起始列
    col = 1
    # 最大打印列
    while col <= row:
        # end = ""  ,表示输出后，不换行
        # "\t" 可以在控制台输出一个制表符，协助 在输出文本时对齐
        # print('%d' % col)
        # print('*', end='')

        print("%d * %d = %d" % (col, row, row * col), end="\t")
        col += 1

    # print('第 %d 行' % row)
    print('')

    row += 1
